// 基础数据
const clientBaseOther = [
  {
    timing:
      '{"上一页面的卸载耗时":-1698222014041,"重定向耗时":0,"查询appDNS缓存耗时":5,"DNS查询耗时":8,"TCP连接建立耗时":11,"服务器响应耗时":77,"request请求耗时":0,"总耗时":359,"解析dom树耗时":-1698222014238}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698222035544,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":44,"request请求耗时":2,"总耗时":393,"解析dom树耗时":-1698222035637}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698222057006,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":41,"request请求耗时":1,"总耗时":286,"解析dom树耗时":-1698222057136}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698222082537,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":44,"request请求耗时":0,"总耗时":298,"解析dom树耗时":-1698222082680}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698222102365,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":36,"request请求耗时":1,"总耗时":286,"解析dom树耗时":-1698222102494}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698222121379,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":38,"request请求耗时":1,"总耗时":304,"解析dom树耗时":-1698222121530}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698222141211,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":43,"request请求耗时":3,"总耗时":293,"解析dom树耗时":-1698222141348}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698222163779,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":43,"request请求耗时":1,"总耗时":238,"解析dom树耗时":-1698222163868}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698222183501,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":36,"request请求耗时":1,"总耗时":281,"解析dom树耗时":-1698222183631}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698222202836,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":41,"request请求耗时":15,"总耗时":299,"解析dom树耗时":-1698222202996}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698222223547,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":35,"request请求耗时":1,"总耗时":293,"解析dom树耗时":-1698222223687}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698222373796,"重定向耗时":0,"查询appDNS缓存耗时":5,"DNS查询耗时":12,"TCP连接建立耗时":9,"服务器响应耗时":33,"request请求耗时":25,"总耗时":268,"解析dom树耗时":-1698222373928}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698222391876,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":35,"request请求耗时":2,"总耗时":281,"解析dom树耗时":-1698222392002}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698222410082,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":37,"request请求耗时":1,"总耗时":283,"解析dom树耗时":-1698222410212}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698222428049,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":34,"request请求耗时":1,"总耗时":235,"解析dom树耗时":-1698222428132}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698222447104,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":38,"request请求耗时":1,"总耗时":240,"解析dom树耗时":-1698222447187}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698222464995,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":37,"request请求耗时":3,"总耗时":239,"解析dom树耗时":-1698222465078}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698222483992,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":33,"request请求耗时":1,"总耗时":250,"解析dom树耗时":-1698222484087}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698222503045,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":32,"request请求耗时":1,"总耗时":276,"解析dom树耗时":-1698222503167}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698222522092,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":37,"request请求耗时":1,"总耗时":283,"解析dom树耗时":-1698222522220}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698222542032,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":36,"request请求耗时":22,"总耗时":298,"解析dom树耗时":-1698222542196}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
];
const clientBase = [
  {
    TTFB: "197",
    FP: "629.819999972824",
    FCP: "629.819999972824",
    LCP: "2225.044",
    TTI: "2549.5549999759533",
    len: 0,
  },
  {
    TTFB: "91",
    FP: "661.7700000060722",
    FCP: "661.7700000060722",
    LCP: "2078.595",
    TTI: "2446.5950000449084",
    len: 1,
  },
  {
    TTFB: "129",
    FP: "558.580000011716",
    FCP: "558.580000011716",
    LCP: "2091.27",
    TTI: "3710.07999998983",
    len: 2,
  },
  {
    TTFB: "143",
    FP: "771.9250000081956",
    FCP: "771.9250000081956",
    LCP: "2171.994",
    TTI: "2513.924999977462",
    len: 3,
  },
  {
    TTFB: "128",
    FP: "566.4399999659508",
    FCP: "566.4399999659508",
    LCP: "2012.914",
    TTI: "2325.5999999819323",
    len: 4,
  },
  {
    TTFB: "150",
    FP: "569.324999989476",
    FCP: "569.324999989476",
    LCP: "2031.465",
    TTI: "2312.3450000421144",
    len: 5,
  },
  {
    TTFB: "134",
    FP: "570.9200000273995",
    FCP: "570.9200000273995",
    LCP: "2116.029",
    TTI: "2446.9849999877624",
    len: 6,
  },
  {
    TTFB: "88",
    FP: "519.8450000025332",
    FCP: "519.8450000025332",
    LCP: "2021.965",
    TTI: "2350.129999977071",
    len: 7,
  },
  {
    TTFB: "129",
    FP: "562.2650000150315",
    FCP: "864.1499999794178",
    LCP: "2353.179",
    TTI: "2681.3700000056997",
    len: 8,
  },
  {
    TTFB: "145",
    FP: "564.635000017006",
    FCP: "564.635000017006",
    LCP: "1971.414",
    TTI: "2274.4199999724515",
    len: 9,
  },
  {
    TTFB: "139",
    FP: "568.219999957364",
    FCP: "568.219999957364",
    LCP: "2057.54",
    TTI: "2396.1750000016764",
    len: 10,
  },
  {
    TTFB: "107",
    FP: "632.1299999835901",
    FCP: "632.1299999835901",
    LCP: "2224.374",
    TTI: "2589.399999997113",
    len: 11,
  },
  {
    TTFB: "124",
    FP: "551.2650000164285",
    FCP: "551.2650000164285",
    LCP: "2107.154",
    TTI: "2431.594999972731",
    len: 12,
  },
  {
    TTFB: "129",
    FP: "559.3999999691732",
    FCP: "559.3999999691732",
    LCP: "2084.96",
    TTI: "2383.3400000003166",
    len: 13,
  },
  {
    TTFB: "82",
    FP: "510.12499997159466",
    FCP: "510.12499997159466",
    LCP: "2006.164",
    TTI: "2356.7549999570474",
    len: 14,
  },
  {
    TTFB: "82",
    FP: "505.6249999906868",
    FCP: "505.6249999906868",
    LCP: "2480.289",
    TTI: "2854.330000001937",
    len: 15,
  },
  {
    TTFB: "80",
    FP: "515.0049999938346",
    FCP: "515.0049999938346",
    LCP: "1958.444",
    TTI: "2273.3899999875575",
    len: 16,
  },
  {
    TTFB: "94",
    FP: "535.7199999853037",
    FCP: "535.7199999853037",
    LCP: "2016.814",
    TTI: "2372.5650000269525",
    len: 17,
  },
  {
    TTFB: "121",
    FP: "549.0700000082143",
    FCP: "549.0700000082143",
    LCP: "2002.525",
    TTI: "2310.2700000163168",
    len: 18,
  },
  {
    TTFB: "127",
    FP: "430.5249999742955",
    FCP: "562.8600000054576",
    LCP: "2078.615",
    TTI: "2352.874999982305",
    len: 19,
  },
  {
    TTFB: "142",
    FP: "510.3850000305101",
    FCP: "510.3850000305101",
    LCP: "2021.14",
    TTI: "2320.9650000208057",
    len: 20,
  },
];

// 优化：按需加载
const clientUnloadSomeModalOther = [
  {
    timing:
      '{"上一页面的卸载耗时":-1698224656880,"重定向耗时":0,"查询appDNS缓存耗时":6,"DNS查询耗时":0,"TCP连接建立耗时":8,"服务器响应耗时":30,"request请求耗时":5,"总耗时":376,"解析dom树耗时":-1698224657037}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698224672934,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":32,"request请求耗时":1,"总耗时":281,"解析dom树耗时":-1698224673054}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698224688809,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":39,"request请求耗时":1,"总耗时":294,"解析dom树耗时":-1698224688941}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698224705173,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":33,"request请求耗时":1,"总耗时":233,"解析dom树耗时":-1698224705250}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698224722198,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":35,"request请求耗时":1,"总耗时":282,"解析dom树耗时":-1698224722321}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698225304701,"重定向耗时":0,"查询appDNS缓存耗时":4,"DNS查询耗时":10,"TCP连接建立耗时":15,"服务器响应耗时":54,"request请求耗时":1,"总耗时":288,"解析dom树耗时":-1698225304830}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698225318694,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":44,"request请求耗时":1,"总耗时":267,"解析dom树耗时":-1698225318836}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698225335434,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":39,"request请求耗时":1,"总耗时":207,"解析dom树耗时":-1698225335516}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698225358104,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":37,"request请求耗时":1,"总耗时":246,"解析dom树耗时":-1698225358228}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698225376783,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":44,"request请求耗时":1,"总耗时":207,"解析dom树耗时":-1698225376866}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698225389733,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":36,"request请求耗时":2,"总耗时":251,"解析dom树耗时":-1698225389860}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698225406963,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":36,"request请求耗时":1,"总耗时":210,"解析dom树耗时":-1698225407040}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698225421954,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":46,"request请求耗时":1,"总耗时":257,"解析dom树耗时":-1698225422089}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698225438757,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":34,"request请求耗时":1,"总耗时":262,"解析dom树耗时":-1698225438898}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698225454251,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":51,"request请求耗时":1,"总耗时":257,"解析dom树耗时":-1698225454389}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698225476665,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":38,"request请求耗时":1,"总耗时":203,"解析dom树耗时":-1698225476745}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698225501169,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":38,"request请求耗时":1,"总耗时":257,"解析dom树耗时":-1698225501301}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698225519694,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":44,"request请求耗时":0,"总耗时":249,"解析dom树耗时":-1698225519822}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698225537751,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":40,"request请求耗时":1,"总耗时":204,"解析dom树耗时":-1698225537836}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698225554922,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":41,"request请求耗时":1,"总耗时":243,"解析dom树耗时":-1698225555046}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698225569403,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":34,"request请求耗时":1,"总耗时":249,"解析dom树耗时":-1698225569533}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698225584669,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":46,"request请求耗时":1,"总耗时":269,"解析dom树耗时":-1698225584816}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698225604008,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":41,"request请求耗时":1,"总耗时":248,"解析dom树耗时":-1698225604134}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698225621897,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":39,"request请求耗时":1,"总耗时":254,"解析dom树耗时":-1698225622029}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698225636037,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":35,"request请求耗时":1,"总耗时":210,"解析dom树耗时":-1698225636125}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
];
const clientUnloadSomeModal = [
  {
    TTFB: "131",
    FP: "567.4049999797717",
    FCP: "567.4049999797717",
    LCP: "1861.97",
    TTI: "1656.6250000032596",
    len: 2,
  },
  {
    TTFB: "122",
    FP: "532.0300000021234",
    FCP: "532.0300000021234",
    LCP: "1896.464",
    TTI: "1662.03000000678",
    len: 4,
  },
  {
    TTFB: "128",
    FP: "428.58499998692423",
    FCP: "516.6650000028312",
    LCP: "1745.225",
    TTI: "1582.18999998644",
    len: 5,
  },
  {
    TTFB: "141",
    FP: "389.5699999993667",
    FCP: "506.08000002102926",
    LCP: "1585.085",
    TTI: "1421.8950000358745",
    len: 6,
  },
  {
    TTFB: "81",
    FP: "317.40500003797933",
    FCP: "450.2850000280887",
    LCP: "1447.229",
    TTI: "1315.3000000165775",
    len: 7,
  },
  {
    TTFB: "123",
    FP: "431.25500000314787",
    FCP: "431.25500000314787",
    LCP: "1888.979",
    TTI: "1727.7650000178255",
    len: 8,
  },
  {
    TTFB: "82",
    FP: "389.7149999975227",
    FCP: "389.7149999975227",
    LCP: "1431.58",
    TTI: "1308.580000011716",
    len: 9,
  },
  {
    TTFB: "125",
    FP: "718.8850000384264",
    FCP: "718.8850000384264",
    LCP: "1794.175",
    TTI: "1665.7850000192411",
    len: 10,
  },
  {
    TTFB: "76",
    FP: "639.1399999847636",
    FCP: "639.1399999847636",
    LCP: "1639.815",
    TTI: "1515.4350000084378",
    len: 11,
  },
  {
    TTFB: "134",
    FP: "374.210000038147",
    FCP: "444.4600000279024",
    LCP: "1586.17",
    TTI: "1455.885000003036",
    len: 12,
  },
  {
    TTFB: "140",
    FP: "479.8849999788217",
    FCP: "479.8849999788217",
    LCP: "1444.994",
    TTI: "1314.0949999797158",
    len: 13,
  },
  {
    TTFB: "137",
    FP: "484.66499999631196",
    FCP: "484.66499999631196",
    LCP: "1468.829",
    TTI: "1336.8800000171177",
    len: 14,
  },
  {
    TTFB: "79",
    FP: "438.0349999992177",
    FCP: "438.0349999992177",
    LCP: "1481.55",
    TTI: "1359.8000000347383",
    len: 15,
  },
  {
    TTFB: "131",
    FP: "467.33000001404434",
    FCP: "467.33000001404434",
    LCP: "1455.034",
    TTI: "1330.9850000077859",
    len: 16,
  },
  {
    TTFB: "128",
    FP: "426.5749999904074",
    FCP: "426.5749999904074",
    LCP: "1454.614",
    TTI: "1323.3250000048429",
    len: 17,
  },
  {
    TTFB: "123",
    FP: "417.03000001143664",
    FCP: "417.03000001143664",
    LCP: "1426.514",
    TTI: "1301.6749999951571",
    len: 19,
  },
  {
    TTFB: "129",
    FP: "423.685000045225",
    FCP: "423.685000045225",
    LCP: "1485.795",
    TTI: "1345.339999999851",
    len: 20,
  },
  {
    TTFB: "146",
    FP: "470.4550000024028",
    FCP: "470.4550000024028",
    LCP: "1458.864",
    TTI: "1329.8899999936111",
    len: 21,
  },
  {
    TTFB: "125",
    FP: "431.8750000093132",
    FCP: "431.8750000093132",
    LCP: "1454.535",
    TTI: "1334.9300000118092",
    len: 22,
  },
  {
    TTFB: "131",
    FP: "461.92999999038875",
    FCP: "461.92999999038875",
    LCP: "1444.619",
    TTI: "1314.669999992475",
    len: 23,
  },
  {
    TTFB: "87",
    FP: "420.540000020992",
    FCP: "420.540000020992",
    LCP: "1486.32",
    TTI: "1339.4100000150502",
    len: 24,
  },
];

// 优化：加载时序
const clientLoadFilesOther = [
  {
    timing:
      '{"上一页面的卸载耗时":-1698225957201,"重定向耗时":0,"查询appDNS缓存耗时":4,"DNS查询耗时":10,"TCP连接建立耗时":9,"服务器响应耗时":80,"request请求耗时":3,"总耗时":264,"解析dom树耗时":-1698225957342}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698225974009,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":43,"request请求耗时":2,"总耗时":220,"解析dom树耗时":-1698225974108}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698225988551,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":95,"request请求耗时":3,"总耗时":311,"解析dom树耗时":-1698225988740}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698226003641,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":37,"request请求耗时":1,"总耗时":211,"解析dom树耗时":-1698226003724}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698226017026,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":32,"request请求耗时":1,"总耗时":195,"解析dom树耗时":-1698226017100}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698226029611,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":31,"request请求耗时":2,"总耗时":240,"解析dom树耗时":-1698226029729}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698226043114,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":38,"request请求耗时":1,"总耗时":205,"解析dom树耗时":-1698226043197}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698226056591,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":32,"request请求耗时":1,"总耗时":199,"解析dom树耗时":-1698226056666}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698226071316,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":38,"request请求耗时":1,"总耗时":250,"解析dom树耗时":-1698226071442}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698226084377,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":36,"request请求耗时":2,"总耗时":205,"解析dom树耗时":-1698226084459}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698226097854,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":38,"request请求耗时":1,"总耗时":218,"解析dom树耗时":-1698226097936}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698226110905,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":36,"request请求耗时":1,"总耗时":291,"解析dom树耗时":-1698226111032}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698226126244,"重定向耗时":0,"查询appDNS缓存耗时":3,"DNS查询耗时":0,"TCP连接建立耗时":8,"服务器响应耗时":36,"request请求耗时":1,"总耗时":225,"解析dom树耗时":-1698226126330}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698226138932,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":34,"request请求耗时":1,"总耗时":240,"解析dom树耗时":-1698226139050}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698226154618,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":32,"request请求耗时":2,"总耗时":217,"解析dom树耗时":-1698226154713}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698226168061,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":34,"request请求耗时":1,"总耗时":198,"解析dom树耗时":-1698226168138}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698226182541,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":34,"request请求耗时":1,"总耗时":245,"解析dom树耗时":-1698226182661}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698226196339,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":37,"request请求耗时":1,"总耗时":212,"解析dom树耗时":-1698226196419}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698226217950,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":33,"request请求耗时":3,"总耗时":209,"解析dom树耗时":-1698226218037}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698226240082,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":35,"request请求耗时":1,"总耗时":244,"解析dom树耗时":-1698226240204}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698226268141,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":38,"request请求耗时":1,"总耗时":205,"解析dom树耗时":-1698226268223}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698226336587,"重定向耗时":0,"查询appDNS缓存耗时":4,"DNS查询耗时":9,"TCP连接建立耗时":8,"服务器响应耗时":35,"request请求耗时":2,"总耗时":279,"解析dom树耗时":-1698226336747}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
];
const clientLoadFile = [
  {
    TTFB: "138",
    FP: "398.15000002272427",
    FCP: "505.70500001776963",
    LCP: "1424.194",
    TTI: "1733.4450000198558",
    len: 0,
  },
  {
    TTFB: "97",
    FP: "412.95999998692423",
    FCP: "412.95999998692423",
    LCP: "1385.045",
    TTI: "3231.694999965839",
    len: 1,
  },
  {
    TTFB: "186",
    FP: "521.9499999657273",
    FCP: "521.9499999657273",
    LCP: "1362.544",
    TTI: "1673.6899999668822",
    len: 2,
  },
  {
    TTFB: "82",
    FP: "432.77499999385327",
    FCP: "432.77499999385327",
    LCP: "1315.935",
    TTI: "1643.2950000162236",
    len: 3,
  },
  {
    TTFB: "73",
    FP: "413.4300000150688",
    FCP: "413.4300000150688",
    LCP: "1271.98",
    TTI: "1613.1700000260025",
    len: 4,
  },
  {
    TTFB: "116",
    FP: "358.5600000224076",
    FCP: "455.7650000206195",
    LCP: "1343.56",
    TTI: "1707.5250000343658",
    len: 5,
  },
  {
    TTFB: "82",
    FP: "377.87000002572313",
    FCP: "377.87000002572313",
    LCP: "1306.29",
    TTI: "1610.240000009071",
    len: 6,
  },
  {
    TTFB: "74",
    FP: "416.69500002171844",
    FCP: "416.69500002171844",
    LCP: "1360.715",
    TTI: "1661.5400000009686",
    len: 7,
  },
  {
    TTFB: "125",
    FP: "508.10499995714054",
    FCP: "508.10499995714054",
    LCP: "1402.639",
    TTI: "1736.7949999752454",
    len: 8,
  },
  {
    TTFB: "80",
    FP: "394.9649999849498",
    FCP: "394.9649999849498",
    LCP: "1297.829",
    TTI: "1602.9749999870546",
    len: 9,
  },
  {
    TTFB: "81",
    FP: "421.8399999663234",
    FCP: "421.8399999663234",
    LCP: "1368.394",
    TTI: "1645.6149999867193",
    len: 10,
  },
  {
    TTFB: "85",
    FP: "431.5949999727309",
    FCP: "431.5949999727309",
    LCP: "1350.359",
    TTI: "1674.1949999704957",
    len: 12,
  },
  {
    TTFB: "117",
    FP: "443.41499998699874",
    FCP: "443.41499998699874",
    LCP: "1334.244",
    TTI: "1668.515000026673",
    len: 13,
  },
  {
    TTFB: "93",
    FP: "394.87999997800216",
    FCP: "394.87999997800216",
    LCP: "1401.689",
    TTI: "1729.8249999876134",
    len: 14,
  },
  {
    TTFB: "76",
    FP: "414.4899999955669",
    FCP: "414.4899999955669",
    LCP: "1359.69",
    TTI: "1658.24000001885",
    len: 15,
  },
  {
    TTFB: "119",
    FP: "435.910000000149",
    FCP: "435.910000000149",
    LCP: "1326.82",
    TTI: "1630.8500000159256",
    len: 16,
  },
  {
    TTFB: "79",
    FP: "407.19500003615394",
    FCP: "407.19500003615394",
    LCP: "1283.24",
    TTI: "1593.8699999824166",
    len: 17,
  },
  {
    TTFB: "84",
    FP: "403.46499998122454",
    FCP: "403.46499998122454",
    LCP: "1281.145",
    TTI: "1560.094999964349",
    len: 18,
  },
  {
    TTFB: "121",
    FP: "461.745000036899",
    FCP: "461.745000036899",
    LCP: "1371.61",
    TTI: "3188.9000000082888",
    len: 19,
  },
  {
    TTFB: "81",
    FP: "402.92999998200685",
    FCP: "402.92999998200685",
    LCP: "1315.064",
    TTI: "1618.5249999980442",
    len: 20,
  },
  {
    TTFB: "158",
    FP: "514.9749999982305",
    FCP: "514.9749999982305",
    LCP: "1478.83",
    TTI: "1818.7800000305288",
    len: 21,
  },
];

// 优化：上述两种
const clientAllOther = [
  {
    timing:
      '{"上一页面的卸载耗时":-1698226812425,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":32,"request请求耗时":1,"总耗时":258,"解析dom树耗时":-1698226812563}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698226832458,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":31,"request请求耗时":2,"总耗时":238,"解析dom树耗时":-1698226832578}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698226848696,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":37,"request请求耗时":2,"总耗时":246,"解析dom树耗时":-1698226848823}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698226864345,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":37,"request请求耗时":1,"总耗时":243,"解析dom树耗时":-1698226864468}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698226880775,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":32,"request请求耗时":1,"总耗时":239,"解析dom树耗时":-1698226880896}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698226897217,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":30,"request请求耗时":2,"总耗时":199,"解析dom树耗时":-1698226897293}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698226915271,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":36,"request请求耗时":1,"总耗时":242,"解析dom树耗时":-1698226915395}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698226935220,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":35,"request请求耗时":1,"总耗时":246,"解析dom树耗时":-1698226935345}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698226953572,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":35,"request请求耗时":1,"总耗时":244,"解析dom树耗时":-1698226953695}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698226972092,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":32,"request请求耗时":1,"总耗时":240,"解析dom树耗时":-1698226972210}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698226989381,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":33,"request请求耗时":1,"总耗时":240,"解析dom树耗时":-1698226989500}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698227005399,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":30,"request请求耗时":1,"总耗时":241,"解析dom树耗时":-1698227005516}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698227022004,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":33,"request请求耗时":4,"总耗时":244,"解析dom树耗时":-1698227022127}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698227042319,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":30,"request请求耗时":1,"总耗时":241,"解析dom树耗时":-1698227042438}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698227059489,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":342,"request请求耗时":2,"总耗时":557,"解析dom树耗时":-1698227059920}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698227077484,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":34,"request请求耗时":1,"总耗时":218,"解析dom树耗时":-1698227077580}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698227094309,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":36,"request请求耗时":2,"总耗时":252,"解析dom树耗时":-1698227094438}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698227112265,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":32,"request请求耗时":1,"总耗时":266,"解析dom树耗时":-1698227112407}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698227120959,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":33,"request请求耗时":2,"总耗时":225,"解析dom树耗时":-1698227121034}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698227139800,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":30,"request请求耗时":1,"总耗时":249,"解析dom树耗时":-1698227139931}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698227150086,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":40,"request请求耗时":0,"总耗时":252,"解析dom树耗时":-1698227150165}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698227158840,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":32,"request请求耗时":1,"总耗时":258,"解析dom树耗时":-1698227158959}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698227166737,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":34,"request请求耗时":1,"总耗时":212,"解析dom树耗时":-1698227166818}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
  {
    timing:
      '{"上一页面的卸载耗时":-1698227175158,"重定向耗时":0,"查询appDNS缓存耗时":0,"DNS查询耗时":0,"TCP连接建立耗时":0,"服务器响应耗时":35,"request请求耗时":3,"总耗时":217,"解析dom树耗时":-1698227175236}',
    navigation: '{"重定向次数":0,"进入页面方式":"正常进入非刷新，非重定向"}',
  },
];
const clinetAll = [
  {
    TTFB: "137",
    FP: "464.0699999872595",
    FCP: "464.0699999872595",
    LCP: "1230.425",
    TTI: "1104.4249999686144",
    len: 0,
  },
  {
    TTFB: "118",
    FP: "447.0149999833666",
    FCP: "447.0149999833666",
    LCP: "1252.119",
    TTI: "1119.974999979604",
    len: 1,
  },
  {
    TTFB: "125",
    FP: "429.2699999641627",
    FCP: "429.2699999641627",
    LCP: "1268.37",
    TTI: "1129.579999949783",
    len: 2,
  },
  {
    TTFB: "122",
    FP: "460.5750000337139",
    FCP: "460.5750000337139",
    LCP: "1199.88",
    TTI: "1072.3550000111572",
    len: 3,
  },
  {
    TTFB: "120",
    FP: "418.5949999955483",
    FCP: "418.5949999955483",
    LCP: "1288.299",
    TTI: "1157.0999999530613",
    len: 4,
  },
  {
    TTFB: "74",
    FP: "387.9750000196509",
    FCP: "387.9750000196509",
    LCP: "1182.495",
    TTI: "1054.37000002712",
    len: 5,
  },
  {
    TTFB: "123",
    FP: "419.1749999881722",
    FCP: "419.1749999881722",
    LCP: "1341.569",
    TTI: "1214.284999994561",
    len: 6,
  },
  {
    TTFB: "124",
    FP: "435.9650000114925",
    FCP: "435.9650000114925",
    LCP: "1349.9",
    TTI: "1205.6849999935366",
    len: 7,
  },
  {
    TTFB: "122",
    FP: "365.15500000678",
    FCP: "452.77999999234453",
    LCP: "1244.44",
    TTI: "1118.7100000097416",
    len: 8,
  },
  {
    TTFB: "117",
    FP: "425.52000004798174",
    FCP: "425.52000004798174",
    LCP: "1181.055",
    TTI: "1059.0100000263192",
    len: 9,
  },
  {
    TTFB: "118",
    FP: "458.7999999639578",
    FCP: "458.7999999639578",
    LCP: "1192.8",
    TTI: "1068.8300000037998",
    len: 10,
  },
  {
    TTFB: "116",
    FP: "455.8100000140257",
    FCP: "455.8100000140257",
    LCP: "1279.44",
    TTI: "1118.465000006836",
    len: 11,
  },
  {
    TTFB: "119",
    FP: "435.7350000063889",
    FCP: "435.7350000063889",
    LCP: "1201.549",
    TTI: "1076.58499997342",
    len: 12,
  },
  {
    TTFB: "118",
    FP: "420.05999997491017",
    FCP: "420.05999997491017",
    LCP: "1209.154",
    TTI: "1071.9349999562837",
    len: 13,
  },
  {
    TTFB: "95",
    FP: "423.64499997347593",
    FCP: "423.64499997347593",
    LCP: "1188.244",
    TTI: "1063.529999984894",
    len: 15,
  },
  {
    TTFB: "141",
    FP: "380.7549999910407",
    FCP: "477.565000008326",
    LCP: "1225.725",
    TTI: "1104.3700000154786",
    len: 17,
  },
  {
    TTFB: "73",
    FP: "433.8999999454245",
    FCP: "433.8999999454245",
    LCP: "1308.024",
    TTI: "1158.419999992475",
    len: 18,
  },
  {
    TTFB: "130",
    FP: "434.42000000504777",
    FCP: "434.42000000504777",
    LCP: "1277.04",
    TTI: "1149.74500000244",
    len: 19,
  },
  {
    TTFB: "79",
    FP: "372.93999997200444",
    FCP: "443.9600000041537",
    LCP: "1269.704",
    TTI: "1140.0399999693036",
    len: 20,
  },
  {
    TTFB: "118",
    FP: "420.6349999876693",
    FCP: "473.05999998934567",
    LCP: "1268.47",
    TTI: "1136.6649999981746",
    len: 21,
  },
  {
    TTFB: "80",
    FP: "458.29999999841675",
    FCP: "458.29999999841675",
    LCP: "1258.679",
    TTI: "1116.8849999667145",
    len: 22,
  },
  {
    TTFB: "75",
    FP: "415.11000000173226",
    FCP: "415.11000000173226",
    LCP: "1204.399",
    TTI: "1076.0749999899417",
    len: 23,
  },
];
const lcp = {
  base: [
    "2225.044",
    "2078.595",
    "2091.27",
    "2171.994",
    "2012.914",
    "2031.465",
    "2116.029",
    "2021.965",
    "2353.179",
    "1971.414",
    "2057.54",
    "2224.374",
    "2107.154",
    "2084.96",
    "2006.164",
    "2480.289",
    "1958.444",
    "2016.814",
    "2002.525",
    "2078.615",
    "2021.14",
  ],
  demandLoad: [
    "1861.97",
    "1896.464",
    "1745.225",
    "1585.085",
    "1447.229",
    "1888.979",
    "1431.58",
    "1794.175",
    "1639.815",
    "1586.17",
    "1444.994",
    "1468.829",
    "1481.55",
    "1455.034",
    "1454.614",
    "1426.514",
    "1485.795",
    "1458.864",
    "1454.535",
    "1444.619",
    "1486.32",
  ],
  concurrentLoad: [
    "1424.194",
    "1385.045",
    "1362.544",
    "1315.935",
    "1271.98",
    "1343.56",
    "1306.29",
    "1360.715",
    "1402.639",
    "1297.829",
    "1368.394",
    "1350.359",
    "1334.244",
    "1401.689",
    "1359.69",
    "1326.82",
    "1283.24",
    "1281.145",
    "1371.61",
    "1315.064",
    "1478.83",
  ],
  final: [
    "1230.425",
    "1252.119",
    "1268.37",
    "1199.88",
    "1288.299",
    "1182.495",
    "1341.569",
    "1349.9",
    "1244.44",
    "1181.055",
    "1192.8",
    "1279.44",
    "1201.549",
    "1209.154",
    "1188.244",
    "1225.725",
    "1308.024",
    "1277.04",
    "1269.704",
    "1268.47",
    "1258.679",
    "1204.399",
  ],
};
const lcp1 = [
  {
    base: "2225.044",
    demandLoad: "1861.97",
    concurrentLoad: "1424.194",
    final: "1230.425",
  },
  {
    base: "2078.595",
    demandLoad: "1896.464",
    concurrentLoad: "1385.045",
    final: "1252.119",
  },
  {
    base: "2091.27",
    demandLoad: "1745.225",
    concurrentLoad: "1362.544",
    final: "1268.37",
  },
  {
    base: "2171.994",
    demandLoad: "1585.085",
    concurrentLoad: "1315.935",
    final: "1199.88",
  },
  {
    base: "2012.914",
    demandLoad: "1447.229",
    concurrentLoad: "1271.98",
    final: "1288.299",
  },
  {
    base: "2031.465",
    demandLoad: "1888.979",
    concurrentLoad: "1343.56",
    final: "1182.495",
  },
  {
    base: "2116.029",
    demandLoad: "1431.58",
    concurrentLoad: "1306.29",
    final: "1341.569",
  },
  {
    base: "2021.965",
    demandLoad: "1794.175",
    concurrentLoad: "1360.715",
    final: "1349.9",
  },
  {
    base: "2353.179",
    demandLoad: "1639.815",
    concurrentLoad: "1402.639",
    final: "1244.44",
  },
  {
    base: "1971.414",
    demandLoad: "1586.17",
    concurrentLoad: "1297.829",
    final: "1181.055",
  },
  {
    base: "2057.54",
    demandLoad: "1444.994",
    concurrentLoad: "1368.394",
    final: "1192.8",
  },
  {
    base: "2224.374",
    demandLoad: "1468.829",
    concurrentLoad: "1350.359",
    final: "1279.44",
  },
  {
    base: "2107.154",
    demandLoad: "1481.55",
    concurrentLoad: "1334.244",
    final: "1201.549",
  },
  {
    base: "2084.96",
    demandLoad: "1455.034",
    concurrentLoad: "1401.689",
    final: "1209.154",
  },
  {
    base: "2006.164",
    demandLoad: "1454.614",
    concurrentLoad: "1359.69",
    final: "1188.244",
  },
  {
    base: "2480.289",
    demandLoad: "1426.514",
    concurrentLoad: "1326.82",
    final: "1225.725",
  },
  {
    base: "1958.444",
    demandLoad: "1485.795",
    concurrentLoad: "1283.24",
    final: "1308.024",
  },
  {
    base: "2016.814",
    demandLoad: "1458.864",
    concurrentLoad: "1281.145",
    final: "1277.04",
  },
  {
    base: "2002.525",
    demandLoad: "1454.535",
    concurrentLoad: "1371.61",
    final: "1269.704",
  },
  {
    base: "2078.615",
    demandLoad: "1444.619",
    concurrentLoad: "1315.064",
    final: "1268.47",
  },
  {
    base: "2021.14",
    demandLoad: "1486.32",
    concurrentLoad: "1478.83",
    final: "1258.679",
  },
];
module.exports = {
  clientBase,
  clientBaseOther,
  clientUnloadSomeModal,
  clientUnloadSomeModalOther,
  clientLoadFile,
  clientLoadFilesOther,
  clinetAll,
  clientAllOther,
};
